
## Plan Result (terraform/aws/users)

[CI link](https://github.com/boxp/arch/actions/runs/8252305695)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_iam_group.admin
  * aws_iam_group_policy_attachment.admin_policy_attachment


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_iam_group.admin will be created
  + resource "aws_iam_group" "admin" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "admin"
      + path      = "/system/"
      + unique_id = (known after apply)
    }

  # aws_iam_group_policy_attachment.admin_policy_attachment will be created
  + resource "aws_iam_group_policy_attachment" "admin_policy_attachment" {
      + group      = "admin"
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":41,"Program":"tfcmt","SHA1":"3998af3d918540386f7a63dd623728dc93ebaa3f","Target":"terraform/aws/users","Vars":{},"WorkflowName":"pull_request_target"} -->